---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeMinimumTreadDepth
source: html/00430ebd-a10c-bae8-fc2a-78b9eb1abd8a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeMinimumTreadDepth Property

"Min. Tread Depth": Minimum Tread Depth

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeMinimumTreadDepth { get; }
```